st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/MB1303_Demo_DRP_CLI/Src/usbpd_dpm_user.c
  DPM_SNK_GetSelectedPDO(PortNum, (IndexSrcPDO - 1), RequestedVoltage, &rdo, &pdo_object);

  status = USBPD_PE_Send_Request(PortNum, rdo.d32, pdo_object);

  return status;
}

/**
  * @brief  Request the PE to send a GET_SRC_CAPA message
  * @param  PortNum The current port number
  * @retval USBPD Status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestGetSourceCapability(uint8_t PortNum)
{
  return USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_GET_SRC_CAP, USBPD_SOPTYPE_SOP);
}

/**
  * @brief  Request the PE to send a GET_SNK_CAPA message
  * @param  PortNum The current port number
  * @retval USBPD Status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestGetSinkCapability(uint8_t PortNum)
{
  return USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_GET_SNK_CAP, USBPD_SOPTYPE_SOP);
}

/**
  * @brief  Request the PE to perform a Data Role Swap.
  * @param  PortNum The current port number
  * @retval USBPD Status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestDataRoleSwap(uint8_t PortNum)
{
  return USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_DR_SWAP, USBPD_SOPTYPE_SOP);
}

/**
  * @brief  Request the PE to perform a Power Role Swap.
  * @param  PortNum The current port number
  * @retval USBPD Status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestPowerRoleSwap(uint8_t PortNum)
{
  return USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_PR_SWAP, USBPD_SOPTYPE_SOP);

}

/**
  * @brief  Request the PE to perform a VCONN Swap.
  * @param  PortNum The current port number
  * @retval USBPD Status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestVconnSwap(uint8_t PortNum)
{
  return USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_VCONN_SWAP, USBPD_SOPTYPE_SOP);
}

/**
  * @brief  Request the PE to send a soft reset
  * @param  PortNum The current port number
  * @param  SOPType SOP Type based on @ref USBPD_SOPType_TypeDef
  * @retval USBPD Status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestSoftReset(uint8_t PortNum, USBPD_SOPType_TypeDef SOPType)
{
  return USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_SOFT_RESET, SOPType);
}

/**
  * @brief  Request the PE to send a Source Capability message.
  * @param  PortNum The current port number
  * @retval USBPD Status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestSourceCapability(uint8_t PortNum)
{
  /* PE will directly get the PDO saved in structure @ref PWR_Port_PDO_Storage */
  return USBPD_PE_Request_DataMessage(PortNum, USBPD_DATAMSG_SRC_CAPABILITIES, NULL, 0);
}



/**
  * @}
  */

/**
  * @brief  Prepare sending of a new Request according to Capabilities Message from Source port
  * @param  PortNum   Index of current used port
  * @retval PDOIndex  Index of PDO within source capabilities message
  *                   PDOIndex must be from 1 to Number of received profiles
  * @retval USBPD status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestNewPowerProfile(uint8_t PortNum, uint8_t PDOIndex)
{
  uint32_t mv = 0, mw = 0, ma = 0;
  USBPD_PDO_TypeDef  pdo;
  USBPD_SNKRDO_TypeDef rdo;
  USBPD_HandleTypeDef *pdhandle = &DPM_Ports[PortNum];
  USBPD_USER_SettingsTypeDef *puser = (USBPD_USER_SettingsTypeDef *)&DPM_USER_Settings[PortNum];

  if((PDOIndex <= pdhandle->DPM_NumberOfRcvSRCPDO) && (PDOIndex > 0))
  {
    /* Extract power information from Power Data Object */
    /* USBPD_DPM_RequestNewPowerProfile: Extract power information from Power Data Object */

    pdo.d32 = pdhandle->DPM_ListOfRcvSRCPDO[PDOIndex - 1];

    mv = PWR_DECODE_50MV(pdo.GenericPDO.VoltageIn50mVunits); /* mV */
    if(pdo.GenericPDO.PowerObject == USBPD_CORE_PDO_TYPE_BATTERY)
    {
      mw = PWR_DECODE_50MV(pdo.SRCBatteryPDO.MinVoltageIn50mVunits); /* mW */
      mw = USBPD_MIN(mw, puser->DPM_SNKRequestedPower.MaxOperatingPowerInmWunits); /* mW */
      ma = mw/mv; /* mA */
    }
    else
    {
      ma = PWR_DECODE_10MA(pdo.SRCFixedPDO.MaxCurrentIn10mAunits); /* mA */
    }
    ma = USBPD_MIN(ma, puser->DPM_SNKRequestedPower.MaxOperatingCurrentInmAunits);
    mw = ma * mv; /* mW */

    rdo.d32 = 0;
    if(pdo.GenericPDO.PowerObject == USBPD_CORE_PDO_TYPE_BATTERY)
    {
      rdo.BatteryRDO.ObjectPosition = PDOIndex;
      rdo.BatteryRDO.OperatingPowerIn250mWunits = mw / 250;
      rdo.BatteryRDO.MaxOperatingPowerIn250mWunits = mw / 250;
      /* USBPD_DPM_RequestNewPowerProfile: Battery Request Data Object %u: %d mW", pdhandle->PE_RequestDOMsg, mw)*/
    }
    else
    {
      rdo.FixedVariableRDO.ObjectPosition = PDOIndex;
      rdo.FixedVariableRDO.OperatingCurrentIn10mAunits = ma / 10;
      rdo.FixedVariableRDO.MaxOperatingCurrent10mAunits = ma / 10;
      /* USBPD_DPM_RequestNewPowerProfile: Fixed Request Data Object %u: %d mV, %d mA", pdhandle->PE_RequestDOMsg, mv, ma) */
    }
    pdhandle->DPM_RequestDOMsg = rdo.d32;
    pdhandle->DPM_RDOPosition = rdo.GenericRDO.ObjectPosition;

    /* Get the requested voltage */
    pdhandle->DPM_RequestedVoltage = mv;
    pdhandle->DPM_RDOPosition = PDOIndex;

    /* Send the REQUEST message to Source port */
    USBPD_PE_Send_Request(PortNum, rdo.d32, pdo.GenericPDO.PowerObject);
  }
  else
  {
    /* USBPD_DPM_RequestNewPowerProfile: Invalid PDO index */
    return USBPD_ERROR;
  }
  return USBPD_OK;
}

/**
  * @brief
  * @param  PortNum Index of current used port
  * @param
  * @retval None.
  */
USBPD_StatusTypeDef USBPD_DPM_CLI_GetStatusInfo(uint8_t PortNum, uint8_t *pProfile, float *pVoltage, uint32_t *pCurrentPDO)
{
  USBPD_StatusTypeDef ret = USBPD_ERROR;
  USBPD_PortPowerRole_TypeDef role = USBPD_PORTPOWERROLE_SNK;
  if (DPM_Ports[PortNum].DPM_IsConnected)
  {
    role = DPM_Params[PortNum].PE_PowerRole;
    if (role == USBPD_PORTPOWERROLE_SNK)
    {
      if (pProfile)
      {
        *pProfile = DPM_Ports[PortNum].DPM_RDOPosition;
        ret = USBPD_OK;
      }
      if (pVoltage)
      {
        *pVoltage = ((float)DPM_Ports[PortNum].DPM_RequestedVoltage) / 1000.0;
        ret = USBPD_OK;
      }
      if (pCurrentPDO)
      {
        *pCurrentPDO = DPM_Ports[PortNum].DPM_RequestDOMsg;
        ret = USBPD_OK;
      }
    }
    if (role == USBPD_PORTPOWERROLE_SRC)
    {
      if (pProfile)
      {
        *pProfile = DPM_Ports[PortNum].DPM_RDOPosition;
        ret = USBPD_OK;
      }
      if (pVoltage)
      {
        *pVoltage = ((float)DPM_Ports[PortNum].DPM_RequestedVoltage) / 1000.0;
        ret = USBPD_OK;
      }
      if (pCurrentPDO)
      {
        *pCurrentPDO = DPM_Ports[PortNum].DPM_RcvRequestDOMsg;
        ret = USBPD_OK;
      }
    }
  }
  return ret;
}

/**
  * @brief  Get PE connection status
  * @param  PortNum           Index of current used port
  * @param  pConnectionStatus Pointer on PE connection status
  * @retval USBPD status
  */
USBPD_StatusTypeDef USBPD_DPM_CLI_GetConnectionStatus(uint8_t PortNum, int8_t *pConnectionStatus)
{
  USBPD_StatusTypeDef ret = USBPD_ERROR;
  if (pConnectionStatus)
  {
    *pConnectionStatus = DPM_Params[PortNum].PE_IsConnected == USBPD_FALSE ? 0x00 : (DPM_Params[PortNum].PE_Power + 1);
    ret = USBPD_OK;
  }
  return ret;
}

/**
  * @brief  Get current power role
  * @param  PortNum           Index of current used port
  * @param  pPortPowerRole    Pointer on the current power role based on @ref USBPD_PortPowerRole_TypeDef
  * @param  pConnectionStatus Pointer on the connection status
  * @param  pDrpSupport       Pointer on boolean indicating DRP support
  * @retval USBPD status
  */
USBPD_StatusTypeDef USBPD_DPM_CLI_GetCurrentRole(uint8_t PortNum, USBPD_PortPowerRole_TypeDef *pPortPowerRole, int8_t * pConnectionStatus, uint8_t *pDrpSupport)
{
  USBPD_StatusTypeDef ret = USBPD_ERROR;
  USBPD_PortPowerRole_TypeDef portPowerRole = USBPD_PORTPOWERROLE_SNK;
  int8_t connectionStatus = DPM_Params[PortNum].PE_Power;
  if (pPortPowerRole)
  {
    /* check the role according to the connection status */
    if (!connectionStatus)
    {
      /* unplugged => using the default role */
      portPowerRole = DPM_Settings[PortNum].PE_DefaultRole;
    }
    else
    {
      /* plugged => using the current role */
      portPowerRole = DPM_Params[PortNum].PE_PowerRole;
    }
    *pPortPowerRole = portPowerRole;
    ret = USBPD_OK;
  }
  if (pConnectionStatus)
  {
    *pConnectionStatus = connectionStatus;
  }
  if (pDrpSupport)
  {
    *pDrpSupport = DPM_Settings[PortNum].CAD_RoleToggle;
  }
  
  return ret;
}

/**
  * @brief  Get active CC line
  * @param  PortNum Index of current used port
  * @retval Active CC line based on @ref CCxPin_TypeDef
  */
CCxPin_TypeDef USBPD_DPM_CLI_GetCCLine(uint8_t PortNum)
{
  return DPM_Params[PortNum].ActiveCCIs;
}

/** @addtogroup USBPD_USER_PRIVATE_FUNCTIONS
  * @{
  */

/**
  * @brief  Find PDO index that offers the most amount of power.
  * @param  PortNum Port number
  * @param  PtrRequestedPower  Sink requested power profile structure pointer
  * @retval Index of PDO within source capabilities message (-1 indicating not found)
  */
static int32_t DPM_FindVoltageIndex(uint32_t PortNum, USBPD_SNKPowerRequest_TypeDef* PtrRequestedPower)
{
  uint32_t *ptpdoarray;
  USBPD_PDO_TypeDef  pdo;
  uint32_t mv = 0, voltage = 0, max_voltage = 0, curr_dist = 0, temp_dist = 0;
  uint32_t nbpdo;
  int8_t curr_index = -1, temp_index = -1;

  /* Max voltage is always limited by the board's max request */
  voltage = PtrRequestedPower->OperatingVoltageInmVunits;
  max_voltage = PtrRequestedPower->MaxOperatingVoltageInmVunits;

  /* The requested voltage not supported by this board */
  if(USBPD_IS_VALID_VOLTAGE(voltage, PtrRequestedPower->MaxOperatingVoltageInmVunits, PtrRequestedPower->MinOperatingVoltageInmVunits) != 1)
  {
    /* DPM_FindVoltageIndex: Requested voltage not supported by the board\r */
    return curr_index;
  }

  /* Search PDO index among Source PDO of Port */
  nbpdo = DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO;
  ptpdoarray = DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO;

  /* search the better PDO in the list of source PDOs */
  for(temp_index = 0; temp_index < nbpdo; temp_index++)
  {
    pdo.d32 = ptpdoarray[temp_index];
      /* get voltage value from PDO */
      mv = pdo.GenericPDO.VoltageIn50mVunits * 50;

      /* check if the source PDO is ok in term of voltage */
      if (mv <= max_voltage)
      {
        /* choose the "better" PDO, in this case only the distance in absolute value from the target voltage */
        temp_dist = mv > voltage ? mv - voltage : voltage - mv;
        if (curr_index == -1 || curr_dist >= temp_dist)
        {
          /* consider the current PDO the better one until this time */
          curr_index = temp_index;
          curr_dist = temp_dist;
        }
      }
  }

  return curr_index;
}

/**
  * @brief  Evaluate received Capabilities Message from Source port and prepare the request message
  * @param  PortNum           Port number
  * @param  IndexSrcPDO       Index on the selected SRC PDO (value between 1 to 7)
  * @param  RequestedVoltage  Requested voltage (in MV and use mainly for APDO)
  * @param  Rdo               Pointer on the RDO
  * @param  PtrPowerObject    Pointer on the selected power object
  * @retval None
  */
void DPM_SNK_GetSelectedPDO(uint8_t PortNum, uint8_t IndexSrcPDO, uint16_t RequestedVoltage, USBPD_SNKRDO_TypeDef* Rdo, USBPD_CORE_PDO_Type_TypeDef *PtrPowerObject)
{
  uint32_t mv = 0, mw = 0, ma = 0;
  USBPD_PDO_TypeDef  pdo;
  USBPD_SNKRDO_TypeDef rdo;
  USBPD_HandleTypeDef *pdhandle = &DPM_Ports[PortNum];
  USBPD_USER_SettingsTypeDef *puser = (USBPD_USER_SettingsTypeDef *)&DPM_USER_Settings[PortNum];

